/*
 *
 * 本题要求编写程序读入N个学生的百分制成绩，统计五分制成绩的分布。百分制成绩到五分制成绩的转换规则：

大于等于90分为A；
小于90且大于等于80为B；
小于80且大于等于70为C；
小于70且大于等于60为D；
小于60为E。
输入格式:

输入在第一行中给出一个正整数N（≤1000），即学生人数；第二行中给出N个学生的百分制成绩，其间以空格分隔。

输出格式:

在一行中输出A、B、C、D、E对应的五分制成绩的人数分布，数字间以空格分隔，行末不得有多余空格。

输入样例:

7

77 54 92 73 60 65 69

输出样例:

1 0 2 3 1
 *
 */


#include<stdio.h>
int main()
{
    int N;
    scanf("%d",&N);
    int i;
    int arr[5]={0};
    int m;
    for(i=0;i<N;i++)
    {
        scanf("%d",&m);
        if(m>=90)arr[0]++;
        else if(m<90&&m>=80) arr[1]++;
        else if(m<80&&m>=70) arr[2]++;
        else if(m<70&&m>=60) arr[3]++;
        else arr[4]++;
    }
    for(i=0;i<5;i++)
    {
        if(i==5-1) printf("%d\n",arr[i]);
        else printf("%d ",arr[i]);
    }
    return 0;
}