/* 打印出如下图案（菱形）。

   *
  ***
 *****
*******
 *****
  ***
   *

*/


#include <stdio.h>

int main()
{
    int i, j, k;
    // 打印上半部分，包括中间的一行
    for (i = 0; i <= 3; i++) // 控制行数，共4行
    {
        // 打印空格，每行星号前的空格数逐行递减
        for (j = 0; j <= 2 - i; j++)
        {
            printf(" ");
        }
        // 打印星号，每行的星号数是当前行数的两倍加一
        for (k = 0; k <= 2 * i; k++)
        {
            printf("*");
        }
        printf("\n");
    }
    // 下半部分
    for (i = 0; i <= 2; i++) // 控制行数，共3行
    {
        // 打印空格，每行星号前的空格数逐行递增
        for (j = 0; j <= i; j++)
        {
            printf(" ");
        }
        // 打印星号，每行的星号数是5减去当前行数的两倍
        for (k = 0; k <= 4 - 2 * i; k++)
        {
            printf("*");
        }
        printf("\n");
    }
    return 0;
}