/*
 *
 * 本题要求编写程序，以hh:mm:ss的格式输出某给定时间再过n秒后的时间值（超过23:59:59就从0点开始计时）。

输入格式：

输入在第一行中以hh:mm:ss的格式给出起始时间，第二行给出整秒数n（<60）。

输出格式：

输出在一行中给出hh:mm:ss格式的结果时间。

输入样例：

11:59:40

30

输出样例：

12:00:10
 *
 */


#include <stdio.h>
int main()
{
    int h,m,s,n,ad;
    scanf("%d:%d:%d",&h,&m,&s);
    scanf("%d",&n);
    ad=3600*h+60*m+s+n;
    ad=ad%86400;
    h=(ad-ad%3600)/3600;
    ad=ad%3600;
    m=(ad-ad%60)/60;
    ad=ad%60;
    s=ad;
    printf("%02d:%02d:%02d",h,m,s);
}